//Типы данных в Swift


//Тип данных <Character> - символ
let x: Character = "Q"

//Тип данных <String> - строка
let y: String = "Swift" 

//Тип данных <Double> - число с плавающей точкой, более точный тип данных 
//Записывает 15 знаков после запятой
let w: Double = 1.00005 

//Тип данных <Float> - число с плавающей точкой, менее точный тип данных
//Записывает 6 знаков после запятой
let z: Float = 1.000006

//Тип данных <Int> - целочисленный тип данных
let d: Int = 777

//Тип данных <Bool> - логическое значение
//Которое определяет "true" - истину и "false" - лож (Да и Нет)
let b: Bool = true

